# Modern CLI tools — install all via: brew bundle
# Each tool is optional; shell aliases only activate if the tool is present.

# Core replacements
brew "eza"           # modern ls (colors, git integration, tree)
brew "bat"           # modern cat (syntax highlighting)
brew "dust"          # modern du (visual disk usage)
brew "fd"            # modern find (fast, regex)
brew "ripgrep"       # modern grep (fast, recursive)

# Navigation & search
brew "zoxide"        # smarter cd (frecency-based)
brew "fzf"           # fuzzy finder (ctrl-r, ctrl-t, alt-c)

# Git enhancements
brew "git-delta"     # modern diff pager (side-by-side, syntax)
brew "lazygit"       # terminal UI for git
brew "gh"            # github CLI

# Docker
brew "lazydocker"    # terminal UI for docker

# Network & diagnostics
brew "mtr"           # better traceroute + ping
brew "httpie"        # better curl (human-friendly HTTP)
brew "xh"            # faster httpie alternative (Rust)
brew "gping"         # ping with live graph
brew "speedtest-cli" # Ookla network speed test (native binary)

# System monitoring
brew "bottom"        # modern top/htop (btm command)
brew "procs"         # modern ps (color, search, tree)

# Dev tools
brew "hyperfine"     # command benchmarking (statistical)
brew "yq"            # YAML/TOML processor (like jq for YAML)
brew "yazi"          # terminal file manager (fast, vim-like)
brew "difftastic"    # syntax-aware diffs (understands code structure)
brew "tokei"         # code line counter (fast, 200+ languages)
brew "onefetch"      # git repo info card (like fastfetch for repos)
brew "trippy"        # network diagnostic TUI (mtr on steroids)
brew "glow"          # render markdown in terminal

# Misc
brew "tldr"          # simplified man pages
brew "jq"            # JSON processor
brew "starship"      # cross-shell prompt
brew "fastfetch"     # system info (modern neofetch replacement)
